/*

ВИЗНАЧЕННЯ СТРУКТУР
===================


Завдання знайдете за посиланням
	https://materials.itstep.org/content/d13e2cb9-a875-4643-9ba8-b6009a467cfb/uk/?cache=0


№1 - використовувати оператори new/delete
№2 - використовувати бібліотеку vector


Навчальний матеріал за посиланням http://surl.li/umeci


Результат роботи: посилання на GitHub





Завдання 1

Описати структуру Student (прізвище, група, успішність (масив із 5 int)). Створити масив студентів і написати програму, що дозволяє:

Динамічно змінювати розмір масиву;
Виводити список відмінників (>75% відмінних оцінок);
Виводити список двієчників (>50% оцінок 2 і 3).



Завдання 2

Описати структуру Man (Прізвище, Ім'я, Вік, Дата народження). Створити масив, передбачити:

Виведення інформації із сортуванням за прізвищем або ім'ям;
Виведення списку іменинників місяця із зазначенням дати народження;
Зміну розмірів масиву під час додавання і видалення записів;
Пошук за прізвищем та ім'ям;
Редагування запису.

*/

#include <iostream>

using namespace std;

int main() {


	return 0;
}